Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 42, 11, 64)        640       
_________________________________________________________________
batch_normalization_3 (Batch (None, 42, 11, 64)        256       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 21, 6, 64)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 19, 4, 32)         18464     
_________________________________________________________________
batch_normalization_4 (Batch (None, 19, 4, 32)         128       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 10, 2, 32)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 9, 1, 32)          4128      
_________________________________________________________________
batch_normalization_5 (Batch (None, 9, 1, 32)          128       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 5, 1, 32)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 160)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                10304     
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 260       
=================================================================
Total params: 34,308
Trainable params: 34,052
Non-trainable params: 256
_________________________________________________________________
