Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 42, 11, 64)        640       
_________________________________________________________________
batch_normalization_9 (Batch (None, 42, 11, 64)        256       
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 21, 6, 64)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 19, 4, 32)         18464     
_________________________________________________________________
batch_normalization_10 (Batc (None, 19, 4, 32)         128       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 10, 2, 32)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 9, 1, 32)          4128      
_________________________________________________________________
batch_normalization_11 (Batc (None, 9, 1, 32)          128       
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 5, 1, 32)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 160)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 64)                10304     
_________________________________________________________________
dense_7 (Dense)              (None, 4)                 260       
=================================================================
Total params: 34,308
Trainable params: 34,052
Non-trainable params: 256
_________________________________________________________________
